# Data Structures in Pandas
## Pandas make use of two different data structures 

* Series 
* Data Frame

### Series represents data in 1D form and Data Frame represents data in 2D tabular form

In [1]:
# pandas series with 1D array with labels

In [5]:
import pandas as pd

In [22]:
# Obtain series from python  dictionories (Data structure for storing key value pairs)
# Keys of Dictionories act as index or label for values
Data = {'a' : 3, 'b' : 'dog', 'c' : 2.5}
pd.Series(Dict)

a      3
b    dog
c    2.5
dtype: object

In [23]:
x = pd.Series (['Merc', 'Audi','VW', 'Benz', 'Tata'],[10,20,30,40,50])
print(x)

10    Merc
20    Audi
30      VW
40    Benz
50    Tata
dtype: object

In [24]:
x = pd.Series (['Merc', 'Audi','VW', 'Benz', 'Tata'],[10,20,30,40,50]) #Second list contains index (datatype)
#index is the label of the values 
# first list contains the values
print(x)

10    Merc
20    Audi
30      VW
40    Benz
50    Tata
dtype: object

In [28]:
x.loc[[10,30,50]] # loc() is label based data selecting method 
# which means that we have to enter the name of the row or column which we want to select

10    Merc
30      VW
50    Tata
dtype: object

In [36]:
x.loc[[20,40]]

20    Audi
40    Benz
dtype: object

In [29]:
print(x.iloc[[0,1,2]])
#iloc() is a indexed based selecting method 
# It means that we have to enter integer index in the method to select specific row/column.

10    Merc
20    Audi
30      VW
dtype: object

In [37]:
x.iloc[1] #access index 1

'Audi'

In [40]:
10 in x # in key word to see if a give nlabe lexists or not

True

In [41]:
 # Data frames - 2D data structure. Stores dta in tabular form (Rows and Columns)
 # <class'pandas.core.frame.dataframe'>

In [47]:
# importing the module
import pandas as pd

# creating a sample dataframe
data = pd.DataFrame({'Brand' : ['Merc', 'Hyundai', 'Tata',
                               'Mahindra', 'Audi', 'BMW',
                                'Renault', 'VW', 'Porsche'],
                    'Year' : [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven' : [50000, 30000, 60000,
                                     25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',
                                'Delhi', 'Mumbai', 'Delhi',
                                'Mumbai','Chennai', 'Ghaziabad'],
                      'Mileage' : [28, 27, 25, 26, 28,
                                 29, 24, 21, 24]})

# displaying the DataFrame
display(data)
print (data)

      Brand  Year  Kms Driven       City  Mileage
0      Merc  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4      Audi  2012       10000     Mumbai       28
5       BMW  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7        VW  2018       15000    Chennai       21
8   Porsche  2019       12000  Ghaziabad       24

      Brand  Year  Kms Driven       City  Mileage
0      Merc  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4      Audi  2012       10000     Mumbai       28
5       BMW  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7        VW  2018       15000    Chennai       21
8   Porsche  2019       12000  Ghaziabad       24

In [52]:
print(type(data))  #this is basically a pandas dataframe

<class 'pandas.core.frame.DataFrame'>

In [56]:
data.index # list of index values

RangeIndex(start=0, stop=9, step=1)

In [55]:
print(data.columns) # list of column names

Index(['Brand', 'Year', 'Kms Driven', 'City', 'Mileage'], dtype='object')

# Read CSV Files

In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [38]:
df = pd.read_csv('D:/Anaconda/Placements.csv')

In [39]:
display (df.head()) # to view column names = it shows only the first five rows

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [40]:
print(df.head(8))

   sl_no gender  ssc_p    ssc_b  hsc_p    hsc_b     hsc_s  degree_p  \
0      1      M  67.00   Others  91.00   Others  Commerce     58.00
1      2      M  79.33  Central  78.33   Others   Science     77.48
2      3      M  65.00  Central  68.00  Central      Arts     64.00
3      4      M  56.00  Central  52.00  Central   Science     52.00
4      5      M  85.80  Central  73.60  Central  Commerce     73.30
5      6      M  55.00   Others  49.80   Others   Science     67.25
6      7      F  46.00   Others  49.20   Others  Commerce     79.00
7      8      M  82.00  Central  64.00  Central   Science     66.00

    degree_t workex  etest_p specialisation  mba_p      status    salary
0   Sci&Tech     No    55.00         Mkt&HR  58.80      Placed  270000.0
1   Sci&Tech    Yes    86.50        Mkt&Fin  66.28      Placed  200000.0
2  Comm&Mgmt     No    75.00        Mkt&Fin  57.80      Placed  250000.0
3   Sci&Tech     No    66.00         Mkt&HR  59.43  Not Placed       NaN
4  Comm&Mgmt     No    96.80        Mkt&Fin  55.50      Placed  425000.0
5   Sci&Tech    Yes    55.00        Mkt&Fin  51.58  Not Placed       NaN
6  Comm&Mgmt     No    74.28        Mkt&Fin  53.29  Not Placed       NaN
7   Sci&Tech    Yes    67.00        Mkt&Fin  62.14      Placed  252000.0

In [31]:
print(df.shape) # to get number of rows and columns

(215, 15)

In [43]:
print (df.columns) # to view all the column names

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

# Read EXCEL file

In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [47]:
df = pd.read_excel('D:/Anaconda/AB.xlsx')

In [48]:
display (df)

    S.No.  MTE (25)  Mini Project (25)  Total (50)  ETE (50)  Total
0       1      5.00                 20       25.00      12.0  37.00
1       2     11.05                 20       31.05      26.0  57.05
2       3      8.10                 20       28.10      14.0  42.10
3       4      6.00                 10       16.00      13.0  29.00
4       5     11.35                 20       31.35      17.0  48.35
..    ...       ...                ...         ...       ...    ...
74     75     12.05                 10       22.05      20.0  42.05
75     76     12.25                 10       22.25      28.0  50.25
76     77      1.75                 10       11.75       NaN   0.00
77     78      3.00                 10       13.00       NaN   0.00
78     79      5.80                 10       15.80      12.0  27.80

[79 rows x 6 columns]

In [49]:
print (df)

    S.No.  MTE (25)  Mini Project (25)  Total (50)  ETE (50)  Total
0       1      5.00                 20       25.00      12.0  37.00
1       2     11.05                 20       31.05      26.0  57.05
2       3      8.10                 20       28.10      14.0  42.10
3       4      6.00                 10       16.00      13.0  29.00
4       5     11.35                 20       31.35      17.0  48.35
..    ...       ...                ...         ...       ...    ...
74     75     12.05                 10       22.05      20.0  42.05
75     76     12.25                 10       22.25      28.0  50.25
76     77      1.75                 10       11.75       NaN   0.00
77     78      3.00                 10       13.00       NaN   0.00
78     79      5.80                 10       15.80      12.0  27.80

[79 rows x 6 columns]

In [50]:
display (df.head(8))

   S.No.  MTE (25)  Mini Project (25)  Total (50)  ETE (50)  Total
0      1      5.00                 20       25.00      12.0  37.00
1      2     11.05                 20       31.05      26.0  57.05
2      3      8.10                 20       28.10      14.0  42.10
3      4      6.00                 10       16.00      13.0  29.00
4      5     11.35                 20       31.35      17.0  48.35
5      6     11.00                 20       31.00      24.0  55.00
6      7     10.50                 15       25.50      18.0  43.50
7      8      9.00                 15       24.00      14.0  38.00

# Read JSON file

In [51]:
import pandas as pd
import json

In [ ]:
df = pd.read_json('filename.json')

In [ ]:
print (df)

In [59]:
web = pd.read_json('https://api.github.com/repositories/858127/issues?per_page=5')

In [57]:
display (web)

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,updated_at,closed_at,author_association,active_lock_reason,body,reactions,timeline_url,performed_via_github_app,draft,pull_request
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/45250,1096579955,I_kwDOAA0YD85BXHtz,45250,"BUG: mypy complaints on ChainMap, FrozenList",...,2022-01-07 18:52:05+00:00,NaT,MEMBER,NaN,I'm getting the following locally with `mypy p...,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,NaN,NaN,NaN
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/45249,1096463717,I_kwDOAA0YD85BWrVl,45249,"BUG: Unexpected behavioral change, NaN support...",...,2022-01-07 18:53:55+00:00,NaT,NONE,NaN,### Pandas version checks\n\n- [X] I have chec...,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,NaN,NaN,NaN
2,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/45248,1096360473,I_kwDOAA0YD85BWSIZ,45248,BUG: `DataFrame.groupby` silently ignores `as_...,...,2022-01-07 14:27:00+00:00,NaT,NONE,NaN,### Pandas version checks\r\n\r\n- [X] I have ...,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,NaN,NaN,NaN
3,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/45247,1096355175,PR_kwDOAA0YD84wqVkb,45247,PERF: find_stack_level,...,2022-01-07 17:25:40+00:00,NaT,MEMBER,NaN,- [ ] closes #45099\r\n- [ ] tests added / pas...,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,NaN,0.0,{'url': 'https://api.github.com/repos/pandas-d...
4,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/45246,1096315616,PR_kwDOAA0YD84wqNgk,45246,TYP: Add types for excel writer classes,...,2022-01-07 16:01:10+00:00,NaT,MEMBER,NaN,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,NaN,0.0,{'url': 'https://api.github.com/repos/pandas-d...

In [ ]:
# specify